<?php

return [
    '0' => 'ok',
    '500' => 'err',
    '405' => 'Method Not Allowed',

    '40101' => '验证码错误',
    '40102' => '账号必须在4-20字之间',
    '40103' => '密码不能为空',

    '40201' => '项目名称必须在2-50字之间',
    '40202' => '项目描述不能超过1000字',
    '40203' => '项目密码必须在6-20字之间',
    '40204' => '项目公开状态错误',
    '40205' => '创建失败',
    '40206' => '项目不存在',

    '40301' => '文档不存在',
    '40302' => '文档密码不正确',
    '40303' => '文档名称不能为空',
    '40304' => '同名文档已存在',
    '40305' => '权限不足',

    '40401' => '账号或密码错误',

    '40501' => '用户昵称最少3个字符，最多20字符',
    '40502' => '用户邮箱不能为空',
    '40503' => '用户邮箱不合法',
    '40504' => '手机号码不合法',
    '40505' => '描述最多500字',
    '40506' => '用户不存在',
    '40507' => '账号不能为空',
    '40508' => '账号必须以英文字母开头并且大于5个字符小于20个字符',
    '40509' => '邮箱已存在',
    '40510' => '超级管理员不能禁用',
    '40511' => '账户已被禁用',
    '40512' => '初始管理员账户不能更改角色',

    '40601' => '原始密码不能为空',
    '40602' => '新密码不能为空',
    '40603' => '确认密码不能为空',
    '40604' => '确认密码不正确',
    '40605' => '原始密码错误',
    '40606' => '密码错误',

    '40701' => '配置名称不能为空且必须大于3个字符小于20字符',
    '40702' => '配置键名必须以英文字母开头并且大于6个字符小于20个字符',
    '40703' => '配置项不存在',
    '40704' => '同名配置已存在',
    '40705' => '系统内置变量无法删除',



    '40801' => '该用户已参与该项目',

    '40901' => '历史文档不存在',

    '50501' => '不允许的文件类型',
    '50502' => '参数错误',

    '20001' => '登录成功',
    '20002' => '创建成功'
];